#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-zk76wxiDTqWyrgmv

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333228000000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221800000002]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221900000003]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210823085950307100000002]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0386200f19a0ec3c9]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-00ae5f3b880ec6324]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-2399265100]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2173523361]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-38523699]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2053659487]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1933826591]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-908692302]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=mlops-eks-PvJaEFg9]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202460000000b]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202140000000a]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202660000000c]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331963400000009]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331955700000008]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-120210823223103220800000001]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210823223103223000000002]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-120210823223103220800000001" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
      ~ vpc_zone_identifier       = [
          - "subnet-02b7b75b8875b6f02",
          - "subnet-06dff361d9daa34ea",
          - "subnet-0a134ea213c4bf0e2",
            # (3 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-220210823223103223000000002" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
      ~ vpc_zone_identifier       = [
          - "subnet-02b7b75b8875b6f02",
          - "subnet-06dff361d9daa34ea",
          - "subnet-0a134ea213c4bf0e2",
            # (3 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "mlops-eks-PvJaEFg9"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822083332937800000001"
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Environment" = "test"
        }
      + version               = "1.20"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-0386200f19a0ec3c9",
            ]
          + subnet_ids                = [
              + "subnet-00dd6ad17f28e0110",
              + "subnet-073345847327cab44",
              + "subnet-0aff3cd4393d112eb",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:30b1d98d-a87d-4fa0-8edf-0aa32cfdf4f9:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-120210823223103220800000001" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-120210823223103220800000001" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-120210823223103220800000001" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmVrbDVUV3BaZWsweGIxaEVWRTE0VFVSbmVVMVVTWGxOYWxsNlRURnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVDNoT0NtWXllRFpWZEdNck0yUmhOSEpVVlhaUlRubHVUemR0T1VsVk5rWTVNelJuVWpSUVYwRXJNV2hYTTBkYWFraExNMkV5Y1RrelZUWldZVFpHV0RoUmMzY0thMFJhVWtOU1JDOXpNRzg0TTBodFYwTjZabmxGUjFKNlltTmlOVXN6VVV0dVZVOTJkVTlETDFFclZFRndTbHB6UW1OTU1GaHNZMFIyUldsRlZHOTJaUXBYTDBobUswVnllRWMwUnpCUVMyMUhibFJaYVhobWJrRjViemxCU0dWdWVWaFNVVUZoV1d4WWJXcElTMVJLVjBaamVrWnhjMVZsT0RBNU5tVjBhSHBIQ21WS1UxY3JTV2h4ZUhaa1RtRmtNbGxPWkZaWk9XcDNjV2RLTm1WWmIwc3dja1p4VDBaT1dqVnNjbmhGWm5WcVJVczRWblEzY0dKbVRYbGFibkJOZVZVS1JIQkpkWGR3YkVWWFpFSjZlV05LUjIxc1NHcE1hVFU1ZW1OUWExRm5kMUJLU0VObGJsQjVRVE5xZUhaTE4xRmlaM0p0U1VjeGFWWkdkVE5uYkc1Wkx3b3lhalJaVVZSUGEwdHlLMlI2T1dGaWREVnJRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkhkRzFrWTFWU1ZXMU1SMnRaUkdJd1ZTdGhSMVZHWmxSSU1qRk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkJaV1o1VVVGMWQwZENkamhNTkdOalVWZENTMGhJZFcxNFdVcG9NakY1VkhST1VFTm1WMmRZV1c5Q2NWcERkVlZOU1Fwb0x6aHRLekZWZG5FM1MxUlRhMG94U0dOTE1uRTVRWGhVVmpZM0sxTjNaRlpzYlRWYU4zZEZhVUZSWVZCNVdWYzNibXRYZEc5Q2Exb3hZVVU1VHpGVENpdHdjWFZtY2l0WU5EZ3hjbFZXWlM5b1JrdzRTR3BqYjBwcFpYVkVhbWRFUjFSUFNYcEhWa3hpY0haWk1FSndZWGx3WmpSc1RuSTNhRVJzVmpkeVprSUtiRVpwSzI1aFJqSkVkazlTTVdad1JETlFlVXMzVWpadVVYTTJkRzFCU0RsQmNHZzJOMEY1TWt4emJreHJkSE5RU0haWFRFbzFhVmx1VkRsV1FTOXFSd3BQUlhwNE9YUjRNbTl1Y0hkcWIzZHNTbFUxZURKaFNVUXhVbGRrUVZBM1ZIVnBTRUUzVm5wTFptaEJiRlFyUWpkYVJ6RkdXa1pNTW1aWmJUWkRPSFpGQ2xkMmVXWkJkbWN4TjBvdlNrcENVamR1VEhCeVpWaFFVMWRSVGxOdlRHSTJSRzExZVFvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQzY2RDA4QzFEMzQ0NzJDRTZENTMzNUUxM0E1OURGNTUuZ3I3LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:9a351d2a-4359-464a-8af4-8bb3d8cb2421:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-220210823223103223000000002" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-220210823223103223000000002" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-220210823223103223000000002" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmVrbDVUV3BaZWsweGIxaEVWRTE0VFVSbmVVMVVTWGxOYWxsNlRURnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVDNoT0NtWXllRFpWZEdNck0yUmhOSEpVVlhaUlRubHVUemR0T1VsVk5rWTVNelJuVWpSUVYwRXJNV2hYTTBkYWFraExNMkV5Y1RrelZUWldZVFpHV0RoUmMzY0thMFJhVWtOU1JDOXpNRzg0TTBodFYwTjZabmxGUjFKNlltTmlOVXN6VVV0dVZVOTJkVTlETDFFclZFRndTbHB6UW1OTU1GaHNZMFIyUldsRlZHOTJaUXBYTDBobUswVnllRWMwUnpCUVMyMUhibFJaYVhobWJrRjViemxCU0dWdWVWaFNVVUZoV1d4WWJXcElTMVJLVjBaamVrWnhjMVZsT0RBNU5tVjBhSHBIQ21WS1UxY3JTV2h4ZUhaa1RtRmtNbGxPWkZaWk9XcDNjV2RLTm1WWmIwc3dja1p4VDBaT1dqVnNjbmhGWm5WcVJVczRWblEzY0dKbVRYbGFibkJOZVZVS1JIQkpkWGR3YkVWWFpFSjZlV05LUjIxc1NHcE1hVFU1ZW1OUWExRm5kMUJLU0VObGJsQjVRVE5xZUhaTE4xRmlaM0p0U1VjeGFWWkdkVE5uYkc1Wkx3b3lhalJaVVZSUGEwdHlLMlI2T1dGaWREVnJRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkhkRzFrWTFWU1ZXMU1SMnRaUkdJd1ZTdGhSMVZHWmxSSU1qRk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkJaV1o1VVVGMWQwZENkamhNTkdOalVWZENTMGhJZFcxNFdVcG9NakY1VkhST1VFTm1WMmRZV1c5Q2NWcERkVlZOU1Fwb0x6aHRLekZWZG5FM1MxUlRhMG94U0dOTE1uRTVRWGhVVmpZM0sxTjNaRlpzYlRWYU4zZEZhVUZSWVZCNVdWYzNibXRYZEc5Q2Exb3hZVVU1VHpGVENpdHdjWFZtY2l0WU5EZ3hjbFZXWlM5b1JrdzRTR3BqYjBwcFpYVkVhbWRFUjFSUFNYcEhWa3hpY0haWk1FSndZWGx3WmpSc1RuSTNhRVJzVmpkeVprSUtiRVpwSzI1aFJqSkVkazlTTVdad1JETlFlVXMzVWpadVVYTTJkRzFCU0RsQmNHZzJOMEY1TWt4emJreHJkSE5RU0haWFRFbzFhVmx1VkRsV1FTOXFSd3BQUlhwNE9YUjRNbTl1Y0hkcWIzZHNTbFUxZURKaFNVUXhVbGRrUVZBM1ZIVnBTRUUzVm5wTFptaEJiRlFyUWpkYVJ6RkdXa1pNTW1aWmJUWkRPSFpGQ2xkMmVXWkJkbWN4TjBvdlNrcENVamR1VEhCeVpWaFFVMWRSVGxOdlRHSTJSRzExZVFvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQzY2RDA4QzFEMzQ0NzJDRTZENTMzNUUxM0E1OURGNTUuZ3I3LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_mlops-eks-PvJaEFg9"
      + id                   = (known after apply)
    }

Plan: 4 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ cluster_endpoint    = "https://C66D08C1D34472CE6D5335E13A59DF55.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
  ~ cluster_id          = "mlops-eks-PvJaEFg9" -> (known after apply)
  ~ config_map_aws_auth = [
      - {
          - binary_data = {}
          - data        = {
              - "mapAccounts" = jsonencode([])
              - "mapRoles"    = <<-EOT
                    - "groups":
                      - "system:bootstrappers"
                      - "system:nodes"
                      "rolearn": "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822084331718600000007"
                      "username": "system:node:{{EC2PrivateDNSName}}"
                EOT
              - "mapUsers"    = jsonencode([])
            }
          - id          = "kube-system/aws-auth"
          - metadata    = [
              - {
                  - annotations      = {}
                  - generate_name    = ""
                  - generation       = 0
                  - labels           = {
                      - "app.kubernetes.io/managed-by" = "Terraform"
                      - "terraform.io/module"          = "terraform-aws-modules.eks.aws"
                    }
                  - name             = "aws-auth"
                  - namespace        = "kube-system"
                  - resource_version = "648"
                  - uid              = "6cab4d00-82f0-46c1-96d9-6e80acf03196"
                },
            ]
        },
    ]
  ~ kubectl_config      = <<-EOT
        apiVersion: v1
        preferences: {}
        kind: Config
        
        clusters:
        - cluster:
            server: https://C66D08C1D34472CE6D5335E13A59DF55.gr7.ap-southeast-2.eks.amazonaws.com
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNekl5TWpZek0xb1hEVE14TURneU1USXlNall6TTFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBT3hOCmYyeDZVdGMrM2RhNHJUVXZRTnluTzdtOUlVNkY5MzRnUjRQV0ErMWhXM0daakhLM2EycTkzVTZWYTZGWDhRc3cKa0RaUkNSRC9zMG84M0htV0N6ZnlFR1J6YmNiNUszUUtuVU92dU9DL1ErVEFwSlpzQmNMMFhsY0R2RWlFVG92ZQpXL0hmK0VyeEc0RzBQS21HblRZaXhmbkF5bzlBSGVueVhSUUFhWWxYbWpIS1RKV0ZjekZxc1VlODA5NmV0aHpHCmVKU1crSWhxeHZkTmFkMllOZFZZOWp3cWdKNmVZb0swckZxT0ZOWjVscnhFZnVqRUs4VnQ3cGJmTXlabnBNeVUKRHBJdXdwbEVXZEJ6eWNKR21sSGpMaTU5emNQa1Fnd1BKSENlblB5QTNqeHZLN1FiZ3JtSUcxaVZGdTNnbG5ZLwoyajRZUVRPa0tyK2R6OWFidDVrQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZHdG1kY1VSVW1MR2tZRGIwVSthR1VGZlRIMjFNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBZWZ5UUF1d0dCdjhMNGNjUVdCS0hIdW14WUpoMjF5VHROUENmV2dYWW9CcVpDdVVNSQpoLzhtKzFVdnE3S1RTa0oxSGNLMnE5QXhUVjY3K1N3ZFZsbTVaN3dFaUFRYVB5WVc3bmtXdG9Ca1oxYUU5TzFTCitwcXVmcitYNDgxclVWZS9oRkw4SGpjb0ppZXVEamdER1RPSXpHVkxicHZZMEJwYXlwZjRsTnI3aERsVjdyZkIKbEZpK25hRjJEdk9SMWZwRDNQeUs3UjZuUXM2dG1BSDlBcGg2N0F5MkxzbkxrdHNQSHZXTEo1aVluVDlWQS9qRwpPRXp4OXR4Mm9ucHdqb3dsSlU1eDJhSUQxUldkQVA3VHVpSEE3VnpLZmhBbFQrQjdaRzFGWkZMMmZZbTZDOHZFCld2eWZBdmcxN0ovSkpCUjduTHByZVhQU1dRTlNvTGI2RG11eQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
          name: eks_mlops-eks-PvJaEFg9
        
        contexts:
        - context:
            cluster: eks_mlops-eks-PvJaEFg9
            user: eks_mlops-eks-PvJaEFg9
          name: eks_mlops-eks-PvJaEFg9
        
        current-context: eks_mlops-eks-PvJaEFg9
        
        users:
        - name: eks_mlops-eks-PvJaEFg9
          user:
            exec:
              apiVersion: client.authentication.k8s.io/v1alpha1
              command: aws-iam-authenticator
              args:
                - "token"
                - "-i"
                - "mlops-eks-PvJaEFg9"
    EOT -> (known after apply)

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*